In [1]:
import pandas as pd

In [4]:
pg = {'python' : {2016:20, 2017:24},
     'c':{2015:23, 2016:22, 2017:21}}

In [5]:
fpg = pd.DataFrame(pg)

In [6]:
fpg

      python   c
2015     NaN  23
2016    20.0  22
2017    24.0  21

In [7]:
fpg.loc[2015]

python     NaN
c         23.0
Name: 2015, dtype: float64

In [8]:
#index 순서대로 데이터프레임만들기

In [9]:
fpg2 = pd.DataFrame(pg, index=[2016, 2015, 2017])

In [10]:
fpg2

      python   c
2016    20.0  22
2015     NaN  23
2017    24.0  21

In [11]:
fpg2['c']

2016    22
2015    23
2017    21
Name: c, dtype: int64

In [12]:
fpg2['c'][:]

2016    22
2015    23
2017    21
Name: c, dtype: int64

In [13]:
fpg2[:]

      python   c
2016    20.0  22
2015     NaN  23
2017    24.0  21

In [14]:
fpg2[:]['c']

2016    22
2015    23
2017    21
Name: c, dtype: int64

In [15]:
#indez, columns에 이름 만들어주기

In [16]:
fpg.columns.name="program"

In [22]:
fpg.index.name="수강인원"

In [23]:
fpg

program  python   c
수강인원
2015        NaN  23
2016       20.0  22
2017       24.0  21

In [24]:
#index 추가하기

In [25]:
book = {'design':['한빛', 2016], 'thinking':['jpup', 2015]}

In [26]:
dfbook = pd.DataFrame(book, index=['출판사', '출판년도'])

In [27]:
dfbook

     design thinking
출판사      한빛     jpup
출판년도   2016     2015

In [28]:
list = [[1,2,3,4],[10,20,30,40],[2.3,4.5,5.6,7.7]]

In [29]:
df = pd.DataFrame(list, index=['one','two','three'], columns=['a','b','c','d'])

In [30]:
df

          a     b     c     d
one     1.0   2.0   3.0   4.0
two    10.0  20.0  30.0  40.0
three   2.3   4.5   5.6   7.7

In [31]:
df2 = pd.DataFrame(list)

In [32]:
df2

      0     1     2     3
0   1.0   2.0   3.0   4.0
1  10.0  20.0  30.0  40.0
2   2.3   4.5   5.6   7.7

In [33]:
dk=({'a':range(7), 'b':range(7,0,-1), 'c':['one', 'one','one', 'two','two','two','two'], 'd':[0,1,2,0,1,2,3]})

In [34]:
dk

{'a': range(0, 7),
 'b': range(7, 0, -1),
 'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
 'd': [0, 1, 2, 0, 1, 2, 3]}

In [35]:
df = pd.DataFrame(dk)

In [36]:
df

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [37]:
df2 = df.set_index('c')

In [38]:
df2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [41]:
df2 = df.set_index('c').count()

In [42]:
df2

a    7
b    7
d    7
dtype: int64

In [43]:
df4 = df.set_index('c').count()['a']

In [45]:
df4

7

In [46]:
df9 = df.set_index(['c', 'd'])

In [47]:
df9

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [49]:
df10 = df.set_index(['c','d']).count()

In [50]:
df10

a    7
b    7
dtype: int64

In [51]:
df11 = df.set_index(['c','d']).count()['a']

In [52]:
df11

7

In [53]:
df

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [87]:
df5 = df.set_index('d').groupby('d').count()

In [88]:
df5

   a  b  c
d
0  2  2  2
1  2  2  2
2  2  2  2
3  1  1  1

In [59]:
df6 = df.set_index(['c','d']).groupby('c').count()['a']

In [60]:
df6

c
one    3
two    4
Name: a, dtype: int64

In [61]:
df7 = df.set_index(['c','d']).groupby('c').count()['a']

In [62]:
df7

c
one    3
two    4
Name: a, dtype: int64

In [63]:
df8 = df.set_index(['c','d']).groupby(['c','d']).count()['a']

In [64]:
df8

c    d
one  0    1
     1    1
     2    1
two  0    1
     1    1
     2    1
     3    1
Name: a, dtype: int64

In [89]:


############################################################################
# 혹시 matplotlib 에서 그림이 안 나올 때
# %matplotlib inline import matplotlib.pyplot as plt 아래 추가
# 자기 생애 나이, 몸무게 --> matlib 으로 작성해서 제출
############################################################################

In [94]:
df16 = df.set_index(['c','d']).groupby(['c']).sum()

In [95]:
df16

      a   b
c
one   3  18
two  18  10

In [98]:
df16 = df.set_index(['c','d']).groupby(['c','d']).sum()

In [99]:
df16

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [100]:
df17 = df.set_index(['c','d']).groupby('c').sum()['a']

In [101]:
df17

c
one     3
two    18
Name: a, dtype: int64

In [102]:
df18 = df.set_index(['c','d']).groupby(['c','d']).sum()

In [103]:
df18

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [104]:
############################################################################
# 혹시 matplotlib 에서 그림이 안 나올 때
# %matplotlib inline import matplotlib.pyplot as plt 아래 추가
# 자기 생애 나이, 몸무게 --> matlib 으로 작성해서 제출
############################################################################

In [105]:
import matplotlib.pyplot as plt

In [107]:
data = {'na':[1,2,3,4,5,6,7,8,9,0,1,2,3,4,5,6],
        'nb':['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
        'nc':[1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6],
        'nd':['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C']}

In [108]:
df = pd.DataFrame(data)

In [109]:
df

    na nb  nc nd
0    1  A   1  A
1    2  A   4  A
2    3  A   5  A
3    4  A   7  A
4    5  A   5  A
5    6  A   5  A
6    7  B   6  B
7    8  B   1  B
8    9  B   4  B
9    0  B   5  B
10   1  B   6  B
11   2  C   7  C
12   3  C   4  C
13   4  C   6  C
14   5  C   4  C
15   6  C   6  C

In [112]:
df1 = df.set_index('nb')

In [113]:
df1

    na  nc nd
nb
A    1   1  A
A    2   4  A
A    3   5  A
A    4   7  A
A    5   5  A
A    6   5  A
B    7   6  B
B    8   1  B
B    9   4  B
B    0   5  B
B    1   6  B
C    2   7  C
C    3   4  C
C    4   6  C
C    5   4  C
C    6   6  C

In [114]:
df2 = df.set_index('nb').groupby('nb')

In [115]:
df2

In [116]:
df3 = df.set_index('nb').groupby('nb').count()

In [117]:
df3

    na  nc  nd
nb
A    6   6   6
B    5   5   5
C    5   5   5

In [ ]:
df4 =